from string import Template
# مطالب RAG (البحث والاسترجاع المُعزز)

# التوجيه العام للنظام (System Prompt)

system_prompt = """
    أنت مساعد لتوليد إجابة للمستخدم.

    سيتم تزويدك بمجموعة من الوثائق المرتبطة باستفسار المستخدم.

    عليك توليد إجابة اعتماداً على الوثائق المقدَّمة فقط.
    
    تجاهل الوثائق غير المرتبطة باستفسار المستخدم.

    يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد إجابة.

    يجب أن تكون الإجابة بنفس لغة استفسار المستخدم.

    كن مهذباً ولطيفاً مع المستخدم.

    كن دقيقاً وموجزاً في إجابتك وتجنب المعلومات غير الضرورية.
    """

# قالب الوثيقة (Document Prompt)
document_prompt = Template("""
    ## الوثيقة رقم: $doc_no 

    ### المحتوى:
    $document_content 
    """
)

# الخاتمة (Footer Prompt)
footer_prompt = Template(
    """اعتماداً فقط على الوثائق أعلاه، يُرجى توليد إجابة للمستخدم.
    ## الإجابة:"""
)